tutorials/solution-time/SIPM-IP/singleCavity/noPred/caseB/constant/solid/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermal
{
    type            constant;
    rho             rho [1 -3 0 0 0] 1.5;//1200;
    C               C [0 2 -2 -1 0] 0.5;//10;
    k               k [1 1 -3 -1  0] 1.6;//1.2;

    gaps
    (
    );

    sources
    (
        /*solidBlock
        {
            type            constant;
            S               S [1 -2 -3 0 0 0 0] 0;
            zones           ( solidBlock );
        }*/
    );
}


// ************************************************************************* //
